{
  "eprint": {
    "title": "Linear Cryptanalysis of Round Reduced SIMON",
    "authors": [
      {
        "name": "Javad Alizadeh",
        "email": "bagheri@gmail",
        "affiliation": ""
      },
      {
        "name": "Nasour Bagheri",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Praveen Gauravaram",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Abhishek Kumar",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Somitra Kumar Sanadhya",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "SIMON is a family of lightweight block ciphers that was proposed by\nU.S National Security Agency (NSA). A cipher in this family with $K$-bit key and $N$-bit block is called\nSIMON ${N}/{K}$. In this paper we analyze the security of SIMON against linear cryptanalysis. We present several linear characteristics for all variants of SIMON with reduced number of rounds. Our best linear characteristic covers SIMON 32/64 reduced to 13 rounds out of 32 rounds with the bias of $2^{-16}$.\n\nIn addition, we describe a connection between linear and differential characteristics for SIMON. This connection is then exploited by using the differential characteristics of the previous work of Abed \\textit{et al.} to construct linear characteristics presented in this work. Our attacks extend to all variants of SIMON covering more number of rounds compared to the previous results on linear cryptanalysis. We have implemented our attacks for small scale variants of SIMON and our experiments confirm the theoretical bias of various characteristics presented in this work. %We also verified the results for SIMON32/64 experimentally to see whether implementation confirms theory.\nSo far, our results are the best known with respect to linear cryptanalysis for any variant of SIMON.",
    "keywords": [
      "SIMON",
      "Linear Characteristic",
      "Linear Cryptanalysis"
    ],
    "category": "Secret-key cryptography",
    "publication_info": "Published elsewhere. Major revision. These results together with other results are published in RFIDSec 2014.",
    "last_updated": "2014-10-16",
    "license": "CC BY",
    "related_papers": []
  }
}
