{
  "eprint": {
    "title": "Self-Protecting Electronic Medical Records Using Attribute-Based Encryption",
    "authors": [
      {
        "name": "Joseph A.  Akinyele",
        "email": "mpagano@cs",
        "affiliation": ""
      },
      {
        "name": "Christoph U.  Lehmann",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Matthew D.  Green",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Matthew W.  Pagano",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Zachary N.  J.  Peterson",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Aviel D.  Rubin",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "We provide a design and implementation of self-protecting electronic medical records (EMRs) using attribute-based encryption. Our system allows healthcare organizations to export EMRs to storage locations outside of their trust boundary, including mobile devices, Regional Health Information Organizations (RHIOs), and cloud systems such as Google Health. In contrast to some previous approaches to this problem, our solution is designed to maintain EMR availability even when providers are offline, i.e., where network connectivity is not available (for example, during a natural disaster). To balance the needs of emergency care and patient privacy, our system is designed to provide for fine-grained encryption and is able to protect individual items within an EMR, where each encrypted item may have its own access control policy. To validate our architecture, we implemented a prototype system using a new dual-policy attribute-based encryption library that we developed. Our implementation, which includes an iPhone app for storing and managing EMRs offline, allows for flexible and automatic policy generation. An evaluation of our design shows that our ABE library performs well, has acceptable storage requirements, and is practical and usable on modern smartphones.",
    "keywords": [
      "implementation",
      "attribute-based encryption",
      "public-key cryptography",
      "electronic medical record",
      "personal health record",
      "self protecting",
      "iphone app",
      "mobile device",
      "continuity of care record",
      "access control",
      "medical security"
    ],
    "category": "Implementation",
    "publication_info": "Published elsewhere. Unknown where it was published",
    "last_updated": "2010-11-18",
    "license": "CC BY",
    "related_papers": []
  }
}
