{
  "eprint": {
    "title": "Automatic Generation of Sound Zero-Knowledge Protocols",
    "authors": [
      {
        "name": "Endre Bangerter",
        "email": "krenn@bfh",
        "affiliation": ""
      },
      {
        "name": "Jan Camenisch",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Stephan Krenn",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Ahmad-Reza Sadeghi",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Thomas Schneider",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "Efficient zero-knowledge proofs of knowledge (ZK-PoK) are basic building blocks of many practical cryptographic applications such as identification schemes, group signatures, and secure multiparty computation. Currently, first applications that essentially rely on ZK-POKs are being deployed in the real world. The most prominent example is Direct Anonymous Attestation (DAA), which was adopted by the Trusted Computing Group (TCG) and implemented as one of the functionalities of the cryptographic chip Trusted Platform Module (TPM).\n\nImplementing systems using ZK-PoK turns out to be challenging, since ZK-PoK are, loosely speaking, significantly more complex than standard crypto primitives, such as encryption and signature schemes. As a result, implementation cycles of ZK-PoK are time-consuming and error-prone, in particular for developers with minor or no cryptographic skills.\n\nTo overcome these challenges, we have designed and implemented a compiler with corresponding languages that given a high-level ZK-PoK protocol specification automatically generates a sound implementation of this. The output is given in form of $\\Sigma$-protocols, which are the most efficient protocols for ZK-PoK currently known. Our compiler translates ZK-PoK protocol specifications, written in a high-level protocol description language, into Java code or \\LaTeX\\ documentation of the protocol.\n\nThe compiler is based on a unified theoretical framework that encompasses a large number of existing ZK-PoK techniques. Within this framework we present a new efficient ZK-PoK protocol for exponentiation homomorphisms in hidden order groups. Our protocol overcomes several limitations of the existing proof techniques.",
    "keywords": [
      "Zero-Knowledge",
      "Protocol Compiler",
      "Language Design"
    ],
    "category": "Implementation",
    "publication_info": "Published elsewhere. This paper will be presented at EuroCrypt 2009 poster session.",
    "last_updated": "2009-02-16",
    "license": "CC BY",
    "related_papers": []
  }
}
