{
  "eprint": {
    "title": "PRINCE - A Low-latency Block Cipher for Pervasive Computing Applications (Full version)",
    "authors": [
      {
        "name": "Julia Borghoff",
        "email": "kavun@rub",
        "affiliation": ""
      },
      {
        "name": "Anne Canteaut",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Tim Güneysu",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Elif Bilge Kavun",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Miroslav Knežević",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Lars R.  Knudsen",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Gregor Leander",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Ventzislav Nikov",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Christof Paar",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Christian Rechberger",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Peter Rombouts",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Søren S.  Thomsen",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Tolga Yalçın",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "This paper presents a block cipher that is optimized with respect to latency when implemented in hardware. Such ciphers are desirable for many future pervasive applications with real-time security needs. Our cipher, named PRINCE, allows encryption of data within one clock cycle with a very competitive chip area compared to known solutions. The fully unrolled fashion in which such algorithms need to be implemented calls for innovative design choices. The number of rounds must be moderate and rounds must have short delays in hardware. At the same time, the traditional need that a cipher has to be iterative with very similar round functions disappears, an observation that increases the design space for the algorithm. An important further requirement is that realizing decryption and encryption results in minimum additional costs. PRINCE is designed in such a way that the overhead for decryption on top of encryption is negligible. More precisely for our cipher it holds that decryption for one key corresponds to encryption with a related key. This property we refer to as alpha-reflection is of independent interest and we prove its soundness against generic attacks.",
    "keywords": [
      "lightweight block cipher",
      "low-latency"
    ],
    "category": "Secret-key cryptography",
    "publication_info": "Published elsewhere. full version of ASIACRYPT 2012 paper",
    "last_updated": "2014-06-12",
    "license": "CC BY",
    "related_papers": []
  }
}
