{
  "eprint": {
    "title": "Scalable Public-Key Tracing and Revoking",
    "authors": [
      {
        "name": "Yevgeniy Dodis",
        "email": "fazio@cs",
        "affiliation": ""
      },
      {
        "name": "Nelly Fazio",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Aggelos Kiayias",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Moti Yung",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "Traitor Tracing Schemes constitute a very useful tool against\npiracy in the context of digital content broadcast. In such\nmulti-recipient encryption schemes, each decryption key is\nfingerprinted and when a pirate decoder is discovered, the\nauthorities can trace the identities of the users that\ncontributed in its construction (called traitors).\n\nPublic-key traitor tracing schemes allow for a multitude of\nnon-trusted content providers using the same set of keys, which\nmakes the scheme ``server-side scalable.''\nTo make such schemes also ``client-side scalable,'' i.e. long lived and usable for a large population of subscribers that changes dynamically over time, it is crucial to implement efficient Add-user and Remove-user operations.\nPrevious work on public-key traitor tracing did not address this\ndynamic scenario thoroughly, and there is no efficient scalable public\nkey traitor tracing scheme that allows an increasing number of Add-user and Remove-user operations.\n\nTo address these issues, we introduce the model of Scalable\nPublic-Key Traitor Tracing, and present the first construction of such\na scheme. Our model mandates for deterministic traitor tracing and an\nunlimited number of efficient Add-user operations and Remove-user operations.\nA scalable system achieves an unlimited number of revocations\nwhile retaining high level of efficiency by dividing the run-time of\nthe system into periods. Each period has a saturation level for the\nnumber of revocations. When a period becomes saturated, an _efficient_ New-period operation is issued by the system server that resets the saturation level.\nWe present a  formal adversarial model for our system taking into\naccount its periodic structure, and we prove our construction secure, both against adversaries that attempt to cheat the revocation mechanism as well as against adversaries that attempt to cheat the traitor tracing mechanism.",
    "keywords": [
      "Digital Content Distribution",
      "Traitor Tracing",
      "Scalability",
      "Broadcast Encryption",
      "Multicast"
    ],
    "category": "Cryptographic protocols",
    "publication_info": "Published elsewhere. Extended abstract of this work appears in proceeding of PODC 2004",
    "last_updated": "2004-07-10",
    "license": "CC BY",
    "related_papers": []
  }
}
