{
  "eprint": {
    "title": "Zero Knowledge Protocols from Succinct Constraint Detection",
    "authors": [
      {
        "name": "Eli Ben-Sasson",
        "email": "alexch@berkeley",
        "affiliation": ""
      },
      {
        "name": "Alessandro Chiesa",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Michael A.  Forbes",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Ariel Gabizon",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Michael Riabzev",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Nicholas Spooner",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "We study the problem of constructing proof systems that achieve both soundness and zero knowledge unconditionally (without relying on intractability assumptions). Known techniques for this goal are primarily *combinatorial*, despite the fact that constructions of interactive proofs (IPs) and probabilistically checkable proofs (PCPs) heavily rely on *algebraic* techniques to achieve their properties.\n\nWe present simple and natural modifications of well-known \"algebraic\" IP and PCP protocols that achieve unconditional (perfect) zero knowledge in recently introduced models, overcoming limitations of known techniques.\n\n1. We modify the PCP of Ben-Sasson and Sudan [BS08] to obtain zero knowledge for NEXP in the model of Interactive Oracle Proofs [BCS16,RRR16], where the verifier, in each round, receives a PCP from the prover.\n\n2. We modify the IP of Lund, Fortnow, Karloff, and Nisan [LFKN92] to obtain zero knowledge for #P in the model of Interactive PCPs [KR08], where the verifier first receives a PCP from the prover and then interacts with him.\n\nThe simulators in our zero knowledge protocols rely on solving a problem that lies at the intersection of coding theory, linear algebra, and computational complexity, which we call the *succinct constraint detection* problem, and consists of detecting dual constraints with polynomial support size for codes of exponential block length. Our two results rely on solutions to this problem for fundamental classes of linear codes:\n\n* An algorithm to detect constraints for Reed--Muller codes of exponential length. This algorithm exploits the Raz--Shpilka [RS05] deterministic polynomial identity testing algorithm, and shows, to our knowledge, a first connection of algebraic complexity theory with zero knowledge.\n\n* An algorithm to detect constraints for PCPs of Proximity of Reed--Solomon codes [BS08] of exponential degree. This algorithm exploits the recursive structure of the PCPs of Proximity to show that small-support constraints are \"locally\" spanned by a small number of small-support constraints.",
    "keywords": [
      "probabilistically checkable proofs",
      "interactive proofs",
      "sumcheck",
      "zero knowledge",
      "polynomial identity testing"
    ],
    "category": "Foundations",
    "publication_info": "A major revision of an IACR publication in TCC 2017",
    "last_updated": "2017-09-21",
    "license": "CC BY",
    "related_papers": []
  }
}
