{
  "eprint": {
    "title": "Short Chosen-Prefix Collisions for MD5 and the Creation of a Rogue CA Certificate",
    "authors": [
      {
        "name": "Marc Stevens",
        "email": "weger@tue",
        "affiliation": ""
      },
      {
        "name": "Alexander Sotirov",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Jacob Appelbaum",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Arjen Lenstra",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "David Molnar",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Dag Arne Osvik",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Benne de Weger",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "We present a refined chosen-prefix collision construction for MD5 that allowed creation of a rogue Certification Authority (CA) certificate, based on a collision with a regular end-user website certificate provided by a commercial CA. Compared to the previous construction from Eurocrypt 2007, this paper describes a more °exible family of differential paths and a new variable birthdaying search space. Combined with a time-memory trade-off, these improvements lead to just three pairs of near-collision blocks to generate the collision, enabling construction of RSA moduli that are sufficiently short to be accepted by current CAs. The entire construction is fast enough to allow for adequate prediction of certificate serial number and validity period: it can be made to require about 2^{49} MD5 compression function calls. Finally, we improve the complexity of identical-prefix collisions for MD5 to about 2^{16} MD5 compression function calls and use it to derive a practical single-block chosen-prefix collision construction of which an example is given.",
    "keywords": [
      "MD5",
      "collision attack",
      "certificate",
      "PlayStation3"
    ],
    "category": "Secret-key cryptography",
    "publication_info": "Published elsewhere. Crypto 2009 proceedings version",
    "last_updated": "2009-06-03",
    "license": "CC BY",
    "related_papers": []
  }
}
