{
  "eprint": {
    "title": "Cryptanalysis of SP Networks with Partial Non-Linear Layers",
    "authors": [
      {
        "name": "Achiya Bar-On",
        "email": "dinur@di",
        "affiliation": ""
      },
      {
        "name": "Itai Dinur",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Orr Dunkelman",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Virginie Lallemand",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Nathan Keller",
        "email": "",
        "affiliation": ""
      },
      {
        "name": "Boaz Tsaban",
        "email": "",
        "affiliation": ""
      }
    ],
    "abstract": "Design of SP networks in which the non-linear layer is applied to only\na part of the state in each round was suggested by Gérard et al.~at CHES 2013.\nBesides performance advantage on certain platforms, such a\ndesign allows for more efficient masking techniques that\ncan mitigate side-channel attacks with a small performance overhead.\n\nIn this paper we present generic techniques for differential and linear\ncryptanalysis of SP networks with partial non-linear layers, including\nan automated characteristic search tool and dedicated key-recovery\nalgorithms. Our techniques can be used both for cryptanalysis of such\nschemes and for proving their security with respect to basic differential and\nlinear cryptanalysis, succeeding where previous automated analysis tools seem to fail.\n\nWe first apply our techniques to the block cipher Zorro (designed by Gérard et\nal.~following their methodology), obtaining practical attacks on the cipher which where fully simulated\non a single desktop PC in a few days. Then, we propose a mild change to Zorro, and\nformally prove its security against basic differential and linear cryptanalysis.\nWe conclude that there is no inherent flaw in the design strategy of Gérard et al.,\nand it can be used in future designs, where our tools should prove useful.",
    "keywords": [
      "Block cipher",
      "Lightweight",
      "Zorro",
      "differential cryptanalysis",
      "linear cryptanalysis"
    ],
    "category": "",
    "publication_info": "A minor revision of an IACR publication in EUROCRYPT 2015",
    "last_updated": "2015-05-26",
    "license": "CC BY",
    "related_papers": []
  }
}
