{
  "eprint": {
    "title": "Another Look at Square Roots and Traces (and Quadratic Equations) in Fields of Even Characteristic",
    "authors": [
      {
        "name": "Roberto Avanzi",
        "email": "avanzi@gmail",
        "affiliation": ""
      }
    ],
    "abstract": "We discuss irreducible polynomials that can be\nused to speed up square root extraction in fields of characteristic two.\nWe call such polynomials \\textit{square root friendly}.\nThe obvious applications are to point halving methods for elliptic curves\nand divisor halving methods for hyperelliptic curves.\n\nWe note the existence of square root friendly trinomials of a given\ndegree when we already know that an irreducible trinomial of the same\ndegree exists, and formulate a conjecture on the degrees of the terms of\nsquare root friendly polynomials.\nWe also give a partial result\nthat goes in the direction of the conjecture.\n\nIrreducible polynomials $p(X)$ such that the square root\n$\\zeta$ of a zero $x$ of $p(X)$ is a sparse polynomial are considered\nand those for which $\\zeta$ has minimal degree are characterized.\nIn doing this we discover a surprising connection\nthese polynomials\nand those defining polynomial bases\nwith an extremal number of trace one elements.\n\nWe also show how to improve the speed of solving quadratic equations and\nthat the increase in the time required to perform modular reduction is\nmarginal and does not affect performance adversely.\nExperimental results confirm that the new polynomials mantain their\npromises; These results generalize work by Fong et al.\\ to polynomials\nother than trinomials.  Point halving gets a speed-up of $20\\%$ and the\nperformance of scalar multiplication based on point halving is improved\nby at least $11\\%$.",
    "keywords": [
      "Binary fields",
      "Polynomial basis",
      "Square root extraction",
      "Trace computation",
      "Quadratic equations",
      "Point halving",
      "Divisor halving."
    ],
    "category": "",
    "publication_info": "Published elsewhere. Unknown where it was published",
    "last_updated": "2007-05-30",
    "license": "CC BY",
    "related_papers": []
  }
}
